# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [1]:
# Get data
import pandas as pd
insura_data = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
insura_data.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [2]:
# Correct/clean the column names
insura_data.columns = ['customer','state','gender','education','customer lifetime_value','income','monthly_premium_auto','number_of_open_complaints','policy_type','vehicle_class','total_claim_amount']

In [3]:
# Check the columns of the data
insura_data.head(2)

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [4]:
# Check the catagory of "gender" column
insura_data['gender'].value_counts()

F         457
M         413
Male       39
female     28
Femal      17
Name: gender, dtype: int64

In [5]:
# Correct the data value of "gender"
gender_mapping = {'Male':'M', 'Femal':'F', 'female':'F', 'F':'F', 'M': 'M'}
insura_data['gender_mapped'] = insura_data['gender'].map(gender_mapping)
insura_data.head(2)

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,NaN
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,F

In [6]:
# Correct state abbriviations
state_mapping = {'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington', 'Oregon':'Oregon','California':'California','Washington':'Washington','Nevada':'Nevada'}
insura_data['state_mapped'] = insura_data['state'].map(state_mapping)
insura_data.head(2)

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,NaN,Washington
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,F,NaN

In [7]:
# Correct Bachelors"
educ_mapping = {'Bachelor':'Bachelor','College':'College','High School or Below':'High School or Below','Master':'Master','Doctor':'Doctor','Bachelors':'Bachelor'}
insura_data['education_mapped'] = insura_data['education'].map(educ_mapping)
insura_data.head(2)

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,NaN,Washington,Master
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,F,NaN,Bachelor

In [8]:
# Remove % from customer life time value
insura_data['customer lifetime_value'] = insura_data['customer lifetime_value'].str.replace('%', '')
insura_data.head(2)

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,NaN,Washington,Master
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,F,NaN,Bachelor

In [9]:
# Correct vehicle class
insura_data['vehicle_class'] = insura_data['vehicle_class'].str.replace('Sports Car', 'Luxury')
insura_data['vehicle_class'] = insura_data['vehicle_class'].str.replace('Luxury SUV', 'Luxury')
insura_data['vehicle_class'] = insura_data['vehicle_class'].str.replace('Luxury Car', 'Luxury')
insura_data['vehicle_class'].value_counts()

Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: vehicle_class, dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [10]:
insura_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 14 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     954 non-null    object
 3   education                  1071 non-null   object
 4   customer lifetime_value    1068 non-null   object
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  1071 non-null   object
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
 11  gender_mapped              954 non-null    object
 12  state_mapped               885 non-null    object
 13  education_mapped           1071 non-null   object
dtypes: float64(3), object(11)
memory usage: 438.5+ KB

In [11]:
# Correct datatype of customer lifetime value
insura_data['customer lifetime_value'] = insura_data['customer lifetime_value'].astype(float)
insura_data.head(3)

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,NaN,Washington,Master
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,F,NaN,Bachelor
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247,F,Nevada,Bachelor

In [22]:
# Check the different values of "number_of_open_complaints" variable
insura_data['number_of_open_complaints'].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [40]:
# Use split() to extract the middle value in "number of open complaints
split_num_comp = insura_data['number_of_open_complaints'].str.split(pat = '/', expand = True)
insura_data['num_of_open_complaints'] = split_num_comp[1]
insura_data.head()

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped,1,num_of_open_complaints
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,NaN,Washington,Master,0,0
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,F,NaN,Bachelor,0,0
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247,F,Nevada,Bachelor,0,0
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344,M,California,Bachelor,0,0
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323,M,Washington,High School or Below,0,0

In [62]:
# Check the value of the new column 'num_of_open_complaints'
insura_data['num_of_open_complaints'].unique()

array(['0', '2', '1', '3', '5', '4', nan], dtype=object)

In [63]:
# Drop unneccessary columns 
insura_data_ = insura_data.drop(['number_of_open_complaints', 1], axis = 1)
insura_data_.head(2)

,customer,state,gender,education,customer lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount,gender_mapped,state_mapped,education_mapped,num_of_open_complaints
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934,NaN,Washington,Master,0
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,Personal Auto,Four-Door Car,1131.464935,F,NaN,Bachelor,0

Since the column has a null value it is not possible to change the datatype to numeric/int, it will raise ValueError: cannot convert float NaN to integer. So, once the null value issue is solved, it can be casted easily.

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [66]:
# Check the null values in the dataframe
insura_data_.isnull().sum()

customer                   2937
state                      2937
gender                     3054
education                  2937
customer lifetime_value    2940
income                     2937
monthly_premium_auto       2937
policy_type                2937
vehicle_class              2937
total_claim_amount         2937
gender_mapped              3054
state_mapped               3123
education_mapped           2937
num_of_open_complaints     2937
dtype: int64

In [68]:
# Check the null values column wise
insura_data_.isna().sum(axis = 1)

0        3
1        1
2        0
3        0
4        0
        ..
4003    14
4004    14
4005    14
4006    14
4007    14
Length: 4008, dtype: int64

In [74]:
# Drop the null values 
insura_data_.dropna(inplace=True)
# Check the dataframe 
insura_data_.shape

(778, 14)

In [76]:
# Check the dataframe if there is stil have null value
insura_data_.isnull().sum()

customer                   0
state                      0
gender                     0
education                  0
customer lifetime_value    0
income                     0
monthly_premium_auto       0
policy_type                0
vehicle_class              0
total_claim_amount         0
gender_mapped              0
state_mapped               0
education_mapped           0
num_of_open_complaints     0
dtype: int64

In [79]:
# Let's cast the 'num_of_open_complaints' from string to integer
insura_data_['num_of_open_complaints'] = insura_data_['num_of_open_complaints'].astype(int)
# Check all datatypes 
insura_data_.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 778 entries, 2 to 1070
Data columns (total 14 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer                 778 non-null    object
 1   state                    778 non-null    object
 2   gender                   778 non-null    object
 3   education                778 non-null    object
 4   customer lifetime_value  778 non-null    float64
 5   income                   778 non-null    float64
 6   monthly_premium_auto     778 non-null    float64
 7   policy_type              778 non-null    object
 8   vehicle_class            778 non-null    object
 9   total_claim_amount       778 non-null    float64
 10  gender_mapped            778 non-null    object
 11  state_mapped             778 non-null    object
 12  education_mapped         778 non-null    object
 13  num_of_open_complaints   778 non-null    int32
dtypes: float64(4), int32(1), object(9)
memory usage: 88.1+ KB

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [82]:
# Let's check for duplicated value in the dataset 
insura_data_.duplicated().sum() # The dataset doesn't have duplicated value

0

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here